// /config.js
(function (w) {
    // w.WEB_BASE = location.origin;          // 协议 + 域名 + 端口
    w.WEB_BASE = "http://10.250.101.238:5000" ||"http://localhost:5000"
    w.API_BASE = w.WEB_BASE + '/api';      // API 前缀
})(window);

const allow_chars_status = new Set([
    "攝","摄","呼","等","韻","韵","入","調","调","清","濁","浊","系","組","组","母",
    "假","咸","宕","山","效","曾","果","梗","止","江","流","深","臻","蟹","通","遇",
    "合","開","开","一","三","二","四","之","仙","佳","侯","侵","元","先","冬","凡","刪","删",
    "咍","唐","嚴","严","夬","宵","寒","尤","幽","庚","廢","废","微","支","文","東","东","桓","模",
    "欣","歌","泰","添","灰","痕","登","皆","真","祭","耕","肴","脂","蒸","蕭","萧","虞","覃",
    "談","谈","豪","銜","衔","鍾","钟","陽","阳","青","魂","魚","鱼","鹽","盐","麻","齊","齐",
    "舒","上","去","平","全","次","幫","帮","知","端","見","见","影","日","曉","晓","泥","章",
    "精","莊","庄","非","並","并","云","雲","以","來","来","初","匣","奉","娘","定","崇","常",
    "從","从","徹","彻","心","敷","昌","明","書","书","溪","滂","澄","生","疑","禪","禅","群","船","透","邪",
    "部", "位", "方", "式", "俟", "齶", "脣", "锐", "銳", "齿", "卷", "软", "双", "A", "B", "C",
    "唇", "齒", "喉", "捲", "舌", "腭", "軟", "雙", "塞", "擦", "近", "鼻",
    "@", "-", "#", "*"," ", "\n", ";"," ,", "\t"
]);

const allow_chars_groups = new Set([
    "攝","摄","呼","等","韻","韵","入","調","调","清","濁","浊","系","組","组","母","部", "位", "方", "式", " ", "\n", ";"," ,", "\t"
]);
const column_values = {
    '攝': ['假', '咸', '宕', '山', '效', '曾', '果', '梗', '止', '江', '流', '深', '臻', '蟹', '通', '遇'],
    '韻': ['之', '仙', '佳', '侯', '侵', '元', '先', '冬', '凡', '刪', '咍', '咸', '唐', '嚴', '夬', '宵', '寒', '尤',
        '山', '幽', '庚', '廢', '微', '支', '文', '東', '模', '欣', '歌', '江', '泰', '添', '清', '灰', '痕', '登',
        '皆', '真', '祭', '耕', '肴', '脂', '臻', '蒸', '蕭', '虞', '覃', '談', '豪', '銜', '鍾', '陽', '青', '魂',
        '魚', '鹽', '麻', '齊'],

    '等': ['一', '二', '三', '三A', '三B', '三C', '三銳', '四'],
    '呼': ['合', '開'],
    '入': ['入', '舒'],

    '清濁': ['全清', '全濁', '次清', '次濁'],
    '系': ['幫', '知', '端', '見'],
    '組': ['幫', '影', '日', '曉', '泥', '知', '章', '端', '精', '莊', '見', '非'],
    '母': ['並', '云', '以', '來', '俟', '初', '匣', '奉', '娘', '定', '崇', '常', '幫', '影', '從', '微', '徹', '心',
        '敷', '日', '昌', '明', '曉', '書', '泥', '清', '溪', '滂', '澄', '生', '疑', '知', '章', '端', '精', '群',
        '船', '莊', '見', '透', '邪', '非'],

    '調': ['上', '入', '去', '平'],
    '部位': ['唇齒', '喉', '捲舌', '腭', '軟腭', '雙唇', '齒'],
    '方式': ['塞', '塞擦', '擦', '近', '鼻'],
}

const STATIC_REGION_TREE = {
    "東北官話": {
        "黑松片": ["嫩克小片","佳富小片","站話小片"],
        "吉瀋片": ["蛟甯小片","延吉小片","通溪小片"],
        "哈阜片": ["肇撫小片","長錦小片"]
    },
    "北京官話": {
        "朝峯片": [],
        "京承片": ["懷承小片","京師小片"]
    },
    "冀魯官話": {
        "保唐片": ["撫龍小片","灤昌小片","薊遵小片","天津小片","定霸小片","淶阜小片"],
        "石濟片": ["趙深小片","邢衡小片","聊泰小片"],
        "滄惠片": ["黃樂小片","陽壽小片","章桓小片","莒照小片"]
    },
    "蘭銀官話": {
        "北疆片": [],
        "金城片": [],
        "河西片": [],
        "銀吳片": []
    },
    "膠遼官話": {
        "登連片": ["煙威小片","蓬龍小片","大岫小片"],
        "蓋桓片": [],
        "靑萊片": ["萊昌小片","靑臨小片","膠蓮小片"]
    },
    "中原官話": {
        "徐淮片": [],
        "兗菏片": [],
        "商阜片": [],
        "信蚌片": [],
        "洛嵩片": [],
        "鄭開片": [],
        "南魯片": [],
        "漯項片": [],
        "關中片": [],
        "秦隴片": [],
        "隴中片": [],
        "南疆片": [],
        "河州片": [],
        "汾河片": ["平陽小片","絳州小片","解州小片"]
    },
    "江淮官話": {
        "黃孝片": [],
        "竹柞片": [],
        "洪巢片": [],
        "泰如片": []
    },
    "西南官話": {
        "湖廣片": ["鄂北小片","懷玉小片","黔東小片","黎靖小片","鄂中小片","湘北小片","湘西小片"],
        "桂柳片": ["湘南小片","黔南小片","桂北小片","桂南小片"],
        "雲南片": ["滇中小片","滇西小片","滇南小片"],
        "川黔片": ["成渝小片","黔中小片","陝南小片"],
        "川西片": ["康藏小片","涼山小片"],
        "西蜀片": ["岷赤小片","雅甘小片","江貢小片"]
    },
    "晉語": {
        "張呼片": [],
        "邯新片": ["磁漳小片","獲濟小片"],
        "上黨片": ["晉城小片","長治小片"],
        "呂梁片": ["隰縣小片","汾州小片"],
        "志延片": [],
        "幷州片": [],
        "五臺片": [],
        "大包片": []
    },
    "贛語": {
        "懷岳片": [],
        "鷹弋片": [],
        "大通片": [],
        "昌都片": [],
        "宜瀏片": [],
        "撫廣片": [],
        "未分片": [],
        "吉茶片": [],
        "耒資片": [],
        "洞綏片": []
    },
    "客家話": {
        "雩信片": [],
        "粵北片·客": [],
        "銅桂片": [],
        "粵臺片": ["梅惠小片","龍華小片"],
        "寧龍片": [],
        "汀州片": [],
        "海陸片": [],
        "畲話": [],
        "粵西片": []
    },
    "吳語": {
        "太湖片": ["杭州小片","毗陵小片","蘇嘉湖小片","上海小片","臨紹小片","甬江小片"],
        "宣州片": ["" +
        "太髙小片","銅涇小片","石陵小片"],
        "台州片": [],
        "金衢片": [],
        "上麗片": ["上山小片","麗水小片"],
        "甌江片": []
    },
    "徽語": {
        "旌占片": [],
        "績歙片": [],
        "休黟片": [],
        "嚴州片": [],
        "祁婺片": []
    },
    "粵語": {
        "廣府片": [],
        "四邑片": [],
        "勾漏片": [],
        "邕潯片": [],
        "欽廉片": [],
        "吳化片": [],
        "高陽片": [],
        "不分類": []
    },
    "閩語": {
        "閩南片": ["泉漳小片","大田小片","潮汕小片"],
        "雷州片": [],
        "瓊文片": ["府城小片","文昌小片","萬甯小片","崖縣小片","昌感小片"],
        "莆仙片": [],
        "閩東片": ["侯官小片","福寧小片"],
        "閩北片": ["建陽小片","建甌小片"],
        "閩中片": [],
        "邵將片": ["將樂小片","邵武小片"]
    },
    "湘語": {
        "長益片": ["長株潭小片","岳陽小片","益沅小片"],
        "婁邵片": ["漣梅小片","湘雙小片","新化小片","武邵小片","綏會小片"],
        "辰漵片": [],
        "衡州片": ["衡山小片","衡陽小片"],
        "永全片": ["全資小片","東祁小片","道江小片"]
    },
    "平話和土話": {
        "湘南片": [],
        "粵北片·土": [],
        "桂北片": [],
        "桂南片": []
    },
    "鄕話": {},
    "民族語": {},
};

const top_yindian = [
    '華北','西北','官話','中上江','下江','兩浙','浙南','湘贛','嶺東','廣中',
    '嶺南','嶺西','閩','湘南','道州','鄕話','白語','蔡家話','民語漢字音'
]